; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v6 - type_3 ?v7 - type_1)
 	      (pred_1 ?v4 - object ?v7 - type_1)
	      (pred_2 ?v6 - type_3 ?v1 - type_2)
	      (pred_3 ?v6 - type_3 ?v4 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v6 - type_3 ?v8 ?v3 - type_1)
       :precondition (and  (pred_4 ?v6 ?v8))
       :effect (and  (pred_4 ?v6 ?v3)
		     (not (pred_4 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_3 ?v2 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v5) (pred_4 ?v6 ?v5) (pred_2 ?v6 ?v1))
       :effect (and (pred_3 ?v6 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v5)) 
		    (not (pred_2 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_3 ?v2 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v2 ?v1) (pred_4 ?v6 ?v5))
       :effect (and (pred_1 ?v2 ?v5)
		    (pred_2 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v2 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_05 - type_3
obj_06 obj_07 obj_12 obj_03 - type_2
obj_09 obj_08 obj_10 - type_1
obj_01 obj_04 obj_11 - object)
(:init
(pred_4 obj_02 obj_08)
(pred_2 obj_02 obj_06)
(pred_2 obj_02 obj_07)
(pred_4 obj_05 obj_10)
(pred_2 obj_05 obj_12)
(pred_2 obj_05 obj_03)
(pred_1 obj_01 obj_08)
(pred_1 obj_04 obj_08)
(pred_1 obj_11 obj_09)
)
(:goal
(and
(pred_1 obj_01 obj_08)
(pred_1 obj_04 obj_10)
(pred_1 obj_11 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_10)))
)
)

; plan
1. (op_3 obj_02 obj_04 obj_08 obj_07)
   deleted: (pred_1 obj_04 obj_08) (pred_2 obj_02 obj_07)
   added: (pred_3 obj_02 obj_04 obj_07)
   goals met: 1 of 3
2. (op_1 obj_05 obj_10 obj_09)
   deleted: (pred_4 obj_05 obj_10)
   added: (pred_4 obj_05 obj_09)
   goals met: 1 of 3
3. (op_1 obj_02 obj_08 obj_09)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_09)
   goals met: 1 of 3
4. (op_3 obj_02 obj_11 obj_09 obj_06)
   deleted: (pred_1 obj_11 obj_09) (pred_2 obj_02 obj_06)
   added: (pred_3 obj_02 obj_11 obj_06)
   goals met: 1 of 3
5. (op_2 obj_02 obj_04 obj_09 obj_07)
   deleted: (pred_3 obj_02 obj_04 obj_07)
   added: (pred_1 obj_04 obj_09) (pred_2 obj_02 obj_07)
   goals met: 1 of 3
6. (op_3 obj_05 obj_04 obj_09 obj_03)
   deleted: (pred_1 obj_04 obj_09) (pred_2 obj_05 obj_03)
   added: (pred_3 obj_05 obj_04 obj_03)
   goals met: 1 of 3
7. (op_2 obj_02 obj_11 obj_09 obj_06)
   deleted: (pred_3 obj_02 obj_11 obj_06)
   added: (pred_1 obj_11 obj_09) (pred_2 obj_02 obj_06)
   goals met: 1 of 3
8. (op_1 obj_05 obj_09 obj_10)
   deleted: (pred_4 obj_05 obj_09)
   added: (pred_4 obj_05 obj_10)
   goals met: 1 of 3
9. (op_2 obj_05 obj_04 obj_10 obj_03)
   deleted: (pred_3 obj_05 obj_04 obj_03)
   added: (pred_1 obj_04 obj_10) (pred_2 obj_05 obj_03)
   goals met: 2 of 3
10. (op_1 obj_05 obj_10 obj_09)
   deleted: (pred_4 obj_05 obj_10)
   added: (pred_4 obj_05 obj_09)
   goals met: 2 of 3
11. (op_3 obj_05 obj_11 obj_09 obj_03)
   deleted: (pred_1 obj_11 obj_09) (pred_2 obj_05 obj_03)
   added: (pred_3 obj_05 obj_11 obj_03)
   goals met: 2 of 3
12. (op_1 obj_05 obj_09 obj_10)
   deleted: (pred_4 obj_05 obj_09)
   added: (pred_4 obj_05 obj_10)
   goals met: 2 of 3
13. (op_2 obj_05 obj_11 obj_10 obj_03)
   deleted: (pred_3 obj_05 obj_11 obj_03)
   added: (pred_1 obj_11 obj_10) (pred_2 obj_05 obj_03)
   goals met: 3 of 3
